In [1]:
import pandas as pd 
df = pd.read_csv('/Users/sundeepk/Desktop/uber.csv')

In [2]:
df.head()

,Unnamed: 0,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,24238194,2015-05-07 19:52:06.0000003,7.5,2015-05-07 19:52:06 UTC,-73.999817,40.738354,-73.999512,40.723217,1
1,27835199,2009-07-17 20:04:56.0000002,7.7,2009-07-17 20:04:56 UTC,-73.994355,40.728225,-73.994710,40.750325,1
2,44984355,2009-08-24 21:45:00.00000061,12.9,2009-08-24 21:45:00 UTC,-74.005043,40.740770,-73.962565,40.772647,1
3,25894730,2009-06-26 08:22:21.0000001,5.3,2009-06-26 08:22:21 UTC,-73.976124,40.790844,-73.965316,40.803349,3
4,17610152,2014-08-28 17:47:00.000000188,16.0,2014-08-28 17:47:00 UTC,-73.925023,40.744085,-73.973082,40.761247,5

In [3]:
#Lets drop the unwanted columns 

df = df.drop(columns = 'key')
df = df.drop(columns = 'Unnamed: 0')

In [4]:
df.columns

Index(['fare_amount', 'pickup_datetime', 'pickup_longitude', 'pickup_latitude',
       'dropoff_longitude', 'dropoff_latitude', 'passenger_count'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   fare_amount        200000 non-null  float64
 1   pickup_datetime    200000 non-null  object
 2   pickup_longitude   200000 non-null  float64
 3   pickup_latitude    200000 non-null  float64
 4   dropoff_longitude  199999 non-null  float64
 5   dropoff_latitude   199999 non-null  float64
 6   passenger_count    200000 non-null  int64
dtypes: float64(5), int64(1), object(1)
memory usage: 10.7+ MB

In [6]:
# lets convert the columns in Datetime format 

df['pickup_datetime'] = pd.to_datetime(df['pickup_datetime'])

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 7 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   fare_amount        200000 non-null  float64
 1   pickup_datetime    200000 non-null  datetime64[ns, UTC]
 2   pickup_longitude   200000 non-null  float64
 3   pickup_latitude    200000 non-null  float64
 4   dropoff_longitude  199999 non-null  float64
 5   dropoff_latitude   199999 non-null  float64
 6   passenger_count    200000 non-null  int64
dtypes: datetime64[ns, UTC](1), float64(5), int64(1)
memory usage: 10.7 MB

In [8]:
df.head()

,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,7.5,2015-05-07 19:52:06+00:00,-73.999817,40.738354,-73.999512,40.723217,1
1,7.7,2009-07-17 20:04:56+00:00,-73.994355,40.728225,-73.994710,40.750325,1
2,12.9,2009-08-24 21:45:00+00:00,-74.005043,40.740770,-73.962565,40.772647,1
3,5.3,2009-06-26 08:22:21+00:00,-73.976124,40.790844,-73.965316,40.803349,3
4,16.0,2014-08-28 17:47:00+00:00,-73.925023,40.744085,-73.973082,40.761247,5

In [9]:
# lets add a few columns based on DAY, MONTH, YEAR, WEEKDAY, HOUR

df['pickup_day'] = df['pickup_datetime'].dt.day
df['pickup_month'] = df['pickup_datetime'].dt.month
df['pickup_year'] = df['pickup_datetime'].dt.year
df['pickup_weekday'] = df['pickup_datetime'].dt.weekday
df['pickup_hour'] = df['pickup_datetime'].dt.hour

In [10]:
df.head()

,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,pickup_day,pickup_month,pickup_year,pickup_weekday,pickup_hour
0,7.5,2015-05-07 19:52:06+00:00,-73.999817,40.738354,-73.999512,40.723217,1,7,5,2015,3,19
1,7.7,2009-07-17 20:04:56+00:00,-73.994355,40.728225,-73.994710,40.750325,1,17,7,2009,4,20
2,12.9,2009-08-24 21:45:00+00:00,-74.005043,40.740770,-73.962565,40.772647,1,24,8,2009,0,21
3,5.3,2009-06-26 08:22:21+00:00,-73.976124,40.790844,-73.965316,40.803349,3,26,6,2009,4,8
4,16.0,2014-08-28 17:47:00+00:00,-73.925023,40.744085,-73.973082,40.761247,5,28,8,2014,3,17

In [11]:
# lets drop the duplicate values 
df = df.drop_duplicates().reset_index(drop=True)

In [12]:
# Create new columns for indexes

df['trip_id'] = df.index
df['datetime'] = df.index

In [13]:
df.head(8)

,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,pickup_day,pickup_month,pickup_year,pickup_weekday,pickup_hour,trip_id,datetime
0,7.5,2015-05-07 19:52:06+00:00,-73.999817,40.738354,-73.999512,40.723217,1,7,5,2015,3,19,0,0
1,7.7,2009-07-17 20:04:56+00:00,-73.994355,40.728225,-73.994710,40.750325,1,17,7,2009,4,20,1,1
2,12.9,2009-08-24 21:45:00+00:00,-74.005043,40.740770,-73.962565,40.772647,1,24,8,2009,0,21,2,2
3,5.3,2009-06-26 08:22:21+00:00,-73.976124,40.790844,-73.965316,40.803349,3,26,6,2009,4,8,3,3
4,16.0,2014-08-28 17:47:00+00:00,-73.925023,40.744085,-73.973082,40.761247,5,28,8,2014,3,17,4,4
5,4.9,2011-02-12 02:27:09+00:00,-73.969019,40.755910,-73.969019,40.755910,1,12,2,2011,5,2,5,5
6,24.5,2014-10-12 07:04:00+00:00,-73.961447,40.693965,-73.871195,40.774297,5,12,10,2014,6,7,6,6
7,2.5,2012-12-11 13:52:00+00:00,0.000000,0.000000,0.000000,0.000000,1,11,12,2012,1,13,7,7

In [14]:
#Push all those new columns to a new dataframe 

df_datetime = df[['datetime', 'pickup_day','pickup_month', 'pickup_year', 
                  'pickup_weekday', 'pickup_hour', 'pickup_weekday']]

In [15]:
df_datetime.head()

,datetime,pickup_day,pickup_month,pickup_year,pickup_weekday,pickup_hour,pickup_weekday
0,0,7,5,2015,3,19,3
1,1,17,7,2009,4,20,4
2,2,24,8,2009,0,21,0
3,3,26,6,2009,4,8,4
4,4,28,8,2014,3,17,3

## The above table is basically our datetime_table in our Schema

In [16]:
df.columns

Index(['fare_amount', 'pickup_datetime', 'pickup_longitude', 'pickup_latitude',
       'dropoff_longitude', 'dropoff_latitude', 'passenger_count',
       'pickup_day', 'pickup_month', 'pickup_year', 'pickup_weekday',
       'pickup_hour', 'trip_id', 'datetime'],
      dtype='object')

In [61]:
# Lets create our Passenger table 

df_passengercount = df[['passenger_count']]

In [52]:
df_passengercount['passenger_count_id'] = df_passengercount.index
df_passengercount = df_passengercount.drop_duplicates().reset_index(drop = True)

In [53]:
df_passengercount = df_passengercount[['passenger_count', 'passenger_count_id']]

In [54]:

df_passengercount

        passenger_count  passenger_count_id
0                     1                   0
1                     1                   1
2                     1                   2
3                     3                   3
4                     5                   4
...                 ...                 ...
199995                1              199995
199996                1              199996
199997                2              199997
199998                1              199998
199999                1              199999

[200000 rows x 2 columns]

## passenger_count_table in Schema

In [56]:
#lets create fare table

df_fareamount = df[['fare_amount']]

In [58]:
df_fareamount['fare_amount_id'] = df_fareamount.index
df_fareamount = df_fareamount.drop_duplicates().reset_index(drop = True)

/var/folders/v8/b8x564d10ysflsrp2k_s2hxw0000gn/T/ipykernel_2644/1865937049.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_fareamount['fare_amount_id'] = df_fareamount.index

In [59]:
df_fareamount = df_fareamount[['fare_amount','fare_amount_id' ]]

In [60]:
df_fareamount

        fare_amount  fare_amount_id
0               7.5               0
1               7.7               1
2              12.9               2
3               5.3               3
4              16.0               4
...             ...             ...
199995          3.0          199995
199996          7.5          199996
199997         30.9          199997
199998         14.5          199998
199999         14.1          199999

[200000 rows x 2 columns]

# Fare_table in Schema

In [81]:
df_droplocation  = df[['dropoff_longitude','dropoff_latitude' ]]
df_droplocation = df_droplocation.drop_duplicates().reset_index(drop=True)

In [82]:
df_droplocation['droplocation_id'] = df_droplocation.index

In [83]:
df_droplocation = df_droplocation[['droplocation_id','dropoff_longitude','dropoff_latitude' ]]

In [84]:
df_droplocation.head()

   droplocation_id  dropoff_longitude  dropoff_latitude
0                0         -73.999512         40.723217
1                1         -73.994710         40.750325
2                2         -73.962565         40.772647
3                3         -73.965316         40.803349
4                4         -73.973082         40.761247

## Drop_location_table in Schema

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 14 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   fare_amount        200000 non-null  float64
 1   pickup_datetime    200000 non-null  datetime64[ns, UTC]
 2   pickup_longitude   200000 non-null  float64
 3   pickup_latitude    200000 non-null  float64
 4   dropoff_longitude  199999 non-null  float64
 5   dropoff_latitude   199999 non-null  float64
 6   passenger_count    200000 non-null  int64
 7   pickup_day         200000 non-null  int64
 8   pickup_month       200000 non-null  int64
 9   pickup_year        200000 non-null  int64
 10  pickup_weekday     200000 non-null  int64
 11  pickup_hour        200000 non-null  int64
 12  trip_id            200000 non-null  int64
 13  datetime           200000 non-null  int64
dtypes: datetime64[ns, UTC](1), float64(5), int64(8)
memory usage: 21.4 MB

In [95]:
df_pickuplocation = df[['pickup_longitude', 'pickup_latitude']]

In [96]:
df_pickuplocation['df_pickuplocation_id'] = df_pickuplocation.index
df_pickuplocation = df_pickuplocation.drop_duplicates().reset_index(drop=True)

/var/folders/v8/b8x564d10ysflsrp2k_s2hxw0000gn/T/ipykernel_2644/1412972100.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_pickuplocation['df_pickuplocation_id'] = df_pickuplocation.index

In [97]:
df_pickuplocation = df_pickuplocation[['df_pickuplocation_id', 'pickup_longitude', 'pickup_latitude']]

In [98]:
df_pickuplocation.head()

   df_pickuplocation_id  pickup_longitude  pickup_latitude
0                     0        -73.999817        40.738354
1                     1        -73.994355        40.728225
2                     2        -74.005043        40.740770
3                     3        -73.976124        40.790844
4                     4        -73.925023        40.744085

# pickuplocation_table in Schema